# < Іваньо Іван >
# Лабораторна робота № 3.1.
# Розгалуження, задане формулою: функція однієї змінної.
# Варіант 0.6

import math

x = float(input())

B = 0
y = 0
A = 5 * math.exp(3 * x)

# Спосіб 1: розгалуження в скороченій формі

if x <= -1:
    B = 3 + math.sin(abs(x))

if -1 < x <= 3:
    B = 2 * math.exp(x / 4 - 1)

if x > 3:
    B = 7 - (2 * x ** 3) ** 0.5

y = A - B

print(y)

# Спосіб 2: розгалуження в повній формі

if x <= -1:
    B = 3 + math.sin(abs(x))
elif -1 < x <= 3:
    B = 2 * math.exp(x / 4 - 1)
else:
    B = 7 - (2 * x ** 3) ** 0.5

y = A - B

print(y)
